<?xml version="1.0" ?>
<net name="torch_jit" version="11">
	<layers>
		<layer id="0" name="data" type="Parameter" version="opset1">
			<data shape="1,3,256,448" element_type="f32"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="data"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="data">
					<dim>1</dim>
					<dim>3</dim>
					<dim>256</dim>
					<dim>448</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="Constant_4894" type="Const" version="opset1">
			<data element_type="f32" shape="1, 3, 1, 1" offset="0" size="12"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_4894"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="Subtract_4895" type="Subtract" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Subtract_4895"/>
				<attribute name="preprocessing" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>256</dim>
					<dim>448</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>256</dim>
					<dim>448</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Constant_9871" type="Const" version="opset1">
			<data element_type="f32" shape="32, 3, 3, 3" offset="12" size="3456"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_4896, Convolution_159, Divide_4897, onnx::Conv_631"/>
				<attribute name="preprocessing" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Convolution_159" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_4896, Convolution_159, Divide_4897, onnx::Conv_631"/>
				<attribute name="preprocessing" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>256</dim>
					<dim>448</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>128</dim>
					<dim>224</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="Reshape_179" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="3468" size="128"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="input.4" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Concat_178, Reshape_179, input.4"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>128</dim>
					<dim>224</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="input.4">
					<dim>1</dim>
					<dim>32</dim>
					<dim>128</dim>
					<dim>224</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="onnx::Conv_403" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="onnx::Conv_403"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>128</dim>
					<dim>224</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="onnx::Conv_403">
					<dim>1</dim>
					<dim>32</dim>
					<dim>128</dim>
					<dim>224</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="Reshape_215" type="Const" version="opset1">
			<data element_type="f32" shape="32, 1, 1, 3, 3" offset="3596" size="1152"/>
			<output>
				<port id="0" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="GroupConvolution_281" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="GroupConvolution_281, Reshape_215"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>128</dim>
					<dim>224</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>128</dim>
					<dim>224</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="Reshape_301" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="4748" size="128"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="input.12" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Concat_300, Reshape_301, input.12"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>128</dim>
					<dim>224</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="input.12">
					<dim>1</dim>
					<dim>32</dim>
					<dim>128</dim>
					<dim>224</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="onnx::Conv_406" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="onnx::Conv_406"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>128</dim>
					<dim>224</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="onnx::Conv_406">
					<dim>1</dim>
					<dim>32</dim>
					<dim>128</dim>
					<dim>224</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="onnx::Conv_637" type="Const" version="opset1">
			<data element_type="f32" shape="64, 32, 1, 1" offset="4876" size="8192"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="onnx::Conv_637"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_637">
					<dim>64</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Convolution_330" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Convolution_330"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>128</dim>
					<dim>224</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>128</dim>
					<dim>224</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="Reshape_350" type="Const" version="opset1">
			<data element_type="f32" shape="1, 64, 1, 1" offset="13068" size="256"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="input.20" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Concat_349, Reshape_350, input.20"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>128</dim>
					<dim>224</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="input.20">
					<dim>1</dim>
					<dim>64</dim>
					<dim>128</dim>
					<dim>224</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="onnx::Conv_409" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="onnx::Conv_409"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>128</dim>
					<dim>224</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="onnx::Conv_409">
					<dim>1</dim>
					<dim>64</dim>
					<dim>128</dim>
					<dim>224</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="Reshape_386" type="Const" version="opset1">
			<data element_type="f32" shape="64, 1, 1, 3, 3" offset="13324" size="2304"/>
			<output>
				<port id="0" precision="FP32">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="GroupConvolution_452" type="GroupConvolution" version="opset1">
			<data strides="2, 2" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="GroupConvolution_452, Reshape_386"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>128</dim>
					<dim>224</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>64</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="Reshape_472" type="Const" version="opset1">
			<data element_type="f32" shape="1, 64, 1, 1" offset="15628" size="256"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="input.28" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Concat_471, Reshape_472, input.28"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>64</dim>
					<dim>112</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="input.28">
					<dim>1</dim>
					<dim>64</dim>
					<dim>64</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="onnx::Conv_412" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="onnx::Conv_412"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>64</dim>
					<dim>112</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="onnx::Conv_412">
					<dim>1</dim>
					<dim>64</dim>
					<dim>64</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="onnx::Conv_643" type="Const" version="opset1">
			<data element_type="f32" shape="128, 64, 1, 1" offset="15884" size="32768"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="onnx::Conv_643"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_643">
					<dim>128</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Convolution_501" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Convolution_501"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>64</dim>
					<dim>112</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="Reshape_521" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128, 1, 1" offset="48652" size="512"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="input.36" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Concat_520, Reshape_521, input.36"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>112</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="input.36">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="onnx::Conv_415" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="onnx::Conv_415"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>112</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="onnx::Conv_415">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="Reshape_557" type="Const" version="opset1">
			<data element_type="f32" shape="128, 1, 1, 3, 3" offset="49164" size="4608"/>
			<output>
				<port id="0" precision="FP32">
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="GroupConvolution_623" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="GroupConvolution_623, Reshape_557"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>112</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Reshape_643" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128, 1, 1" offset="53772" size="512"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="input.44" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Concat_642, Reshape_643, input.44"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>112</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="input.44">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="onnx::Conv_418" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="onnx::Conv_418"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>112</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="onnx::Conv_418">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="onnx::Conv_649" type="Const" version="opset1">
			<data element_type="f32" shape="128, 128, 1, 1" offset="54284" size="65536"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="onnx::Conv_649"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_649">
					<dim>128</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="Convolution_672" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Convolution_672"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>112</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="Reshape_692" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128, 1, 1" offset="119820" size="512"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="input.52" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Concat_691, Reshape_692, input.52"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>112</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="input.52">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="onnx::Conv_421" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="onnx::Conv_421"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>112</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="onnx::Conv_421">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="Reshape_728" type="Const" version="opset1">
			<data element_type="f32" shape="128, 1, 1, 3, 3" offset="120332" size="4608"/>
			<output>
				<port id="0" precision="FP32">
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="GroupConvolution_794" type="GroupConvolution" version="opset1">
			<data strides="2, 2" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="GroupConvolution_794, Reshape_728"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>112</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="Reshape_814" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128, 1, 1" offset="124940" size="512"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="input.60" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Concat_813, Reshape_814, input.60"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="input.60">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="onnx::Conv_424" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="onnx::Conv_424"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="onnx::Conv_424">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="onnx::Conv_655" type="Const" version="opset1">
			<data element_type="f32" shape="256, 128, 1, 1" offset="125452" size="131072"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="onnx::Conv_655"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_655">
					<dim>256</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="Convolution_843" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Convolution_843"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="Reshape_863" type="Const" version="opset1">
			<data element_type="f32" shape="1, 256, 1, 1" offset="256524" size="1024"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="input.68" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Concat_862, Reshape_863, input.68"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="input.68">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="onnx::Conv_427" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="onnx::Conv_427"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="onnx::Conv_427">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="Reshape_899" type="Const" version="opset1">
			<data element_type="f32" shape="256, 1, 1, 3, 3" offset="257548" size="9216"/>
			<output>
				<port id="0" precision="FP32">
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="GroupConvolution_965" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="GroupConvolution_965, Reshape_899"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="Reshape_985" type="Const" version="opset1">
			<data element_type="f32" shape="1, 256, 1, 1" offset="266764" size="1024"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="input.76" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Concat_984, Reshape_985, input.76"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="input.76">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="onnx::Conv_430" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="onnx::Conv_430"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="onnx::Conv_430">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="onnx::Conv_661" type="Const" version="opset1">
			<data element_type="f32" shape="256, 256, 1, 1" offset="267788" size="262144"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="onnx::Conv_661"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_661">
					<dim>256</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="Convolution_1014" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Convolution_1014"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="Reshape_1034" type="Const" version="opset1">
			<data element_type="f32" shape="1, 256, 1, 1" offset="529932" size="1024"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="input.84" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Concat_1033, Reshape_1034, input.84"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="input.84">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="onnx::Conv_433" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="onnx::Conv_433"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="onnx::Conv_433">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="Reshape_1070" type="Const" version="opset1">
			<data element_type="f32" shape="256, 1, 1, 3, 3" offset="530956" size="9216"/>
			<output>
				<port id="0" precision="FP32">
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="GroupConvolution_1136" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="GroupConvolution_1136, Reshape_1070"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="Reshape_1156" type="Const" version="opset1">
			<data element_type="f32" shape="1, 256, 1, 1" offset="540172" size="1024"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="input.92" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Concat_1155, Reshape_1156, input.92"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="input.92">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="onnx::Conv_436" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="onnx::Conv_436"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="onnx::Conv_436">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="onnx::Conv_667" type="Const" version="opset1">
			<data element_type="f32" shape="512, 256, 1, 1" offset="541196" size="524288"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="onnx::Conv_667"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_667">
					<dim>512</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="Convolution_1185" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Convolution_1185"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="Reshape_1205" type="Const" version="opset1">
			<data element_type="f32" shape="1, 512, 1, 1" offset="1065484" size="2048"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="input.100" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Concat_1204, Reshape_1205, input.100"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="input.100">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="onnx::Conv_439" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="onnx::Conv_439"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="onnx::Conv_439">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="Reshape_1241" type="Const" version="opset1">
			<data element_type="f32" shape="512, 1, 1, 3, 3" offset="1067532" size="18432"/>
			<output>
				<port id="0" precision="FP32">
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="GroupConvolution_1307" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="2, 2" pads_end="2, 2" dilations="2, 2" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="GroupConvolution_1307, Reshape_1241"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="Reshape_1327" type="Const" version="opset1">
			<data element_type="f32" shape="1, 512, 1, 1" offset="1085964" size="2048"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="input.108" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Concat_1326, Reshape_1327, input.108"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="input.108">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="onnx::Conv_442" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="onnx::Conv_442"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="onnx::Conv_442">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="onnx::Conv_673" type="Const" version="opset1">
			<data element_type="f32" shape="512, 512, 1, 1" offset="1088012" size="1048576"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="onnx::Conv_673"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_673">
					<dim>512</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="Convolution_1356" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Convolution_1356"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="Reshape_1376" type="Const" version="opset1">
			<data element_type="f32" shape="1, 512, 1, 1" offset="2136588" size="2048"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="input.116" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Concat_1375, Reshape_1376, input.116"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="input.116">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="onnx::Conv_445" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="onnx::Conv_445"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="onnx::Conv_445">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="Reshape_1412" type="Const" version="opset1">
			<data element_type="f32" shape="512, 1, 1, 3, 3" offset="2138636" size="18432"/>
			<output>
				<port id="0" precision="FP32">
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="GroupConvolution_1478" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="GroupConvolution_1478, Reshape_1412"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="Reshape_1498" type="Const" version="opset1">
			<data element_type="f32" shape="1, 512, 1, 1" offset="2157068" size="2048"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="input.124" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Concat_1497, Reshape_1498, input.124"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="input.124">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="onnx::Conv_448" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="onnx::Conv_448"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="onnx::Conv_448">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="onnx::Conv_679" type="Const" version="opset1">
			<data element_type="f32" shape="512, 512, 1, 1" offset="2159116" size="1048576"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="onnx::Conv_679"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_679">
					<dim>512</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="Convolution_1527" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Convolution_1527"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="Reshape_1547" type="Const" version="opset1">
			<data element_type="f32" shape="1, 512, 1, 1" offset="3207692" size="2048"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="input.132" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Concat_1546, Reshape_1547, input.132"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="input.132">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="onnx::Conv_451" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="onnx::Conv_451"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="onnx::Conv_451">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="Reshape_1583" type="Const" version="opset1">
			<data element_type="f32" shape="512, 1, 1, 3, 3" offset="3209740" size="18432"/>
			<output>
				<port id="0" precision="FP32">
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="GroupConvolution_1649" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="GroupConvolution_1649, Reshape_1583"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="Reshape_1669" type="Const" version="opset1">
			<data element_type="f32" shape="1, 512, 1, 1" offset="3228172" size="2048"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="input.140" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Concat_1668, Reshape_1669, input.140"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="input.140">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="onnx::Conv_454" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="onnx::Conv_454"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="onnx::Conv_454">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="onnx::Conv_685" type="Const" version="opset1">
			<data element_type="f32" shape="512, 512, 1, 1" offset="3230220" size="1048576"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="onnx::Conv_685"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_685">
					<dim>512</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="Convolution_1698" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Convolution_1698"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="Reshape_1718" type="Const" version="opset1">
			<data element_type="f32" shape="1, 512, 1, 1" offset="4278796" size="2048"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="input.148" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Concat_1717, Reshape_1718, input.148"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="input.148">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="onnx::Conv_457" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="onnx::Conv_457"/>
			</rt_info>
			<input>
